Revit 2027 API
DividedPathFailures Properties
The BuiltInFailures.DividedPathFailures type exposes the following members.
Properties
Name | Description
DividedPathCannotApplyDivideSettings |  Default Divide settings cannot be applied to Divided Path.
DividedPathCannotBeMirroredWithoutItsCurves |  Divided path cannot be mirrored without its curves.
DividedPathCannotCreateFromGeometry |  Highlighted geometry contains a path or edge that could not be divided.
DividedPathDistanceTooSmall |  Distance is too small.
DividedPathIndentsOverlap |  Beginning indent and end indent overlap.
DividedPathIntersectionPolycurveParamsStepFailed |  Intersection failed.
DividedPathInvalidNumberOfPoints |  End indent is too large.
DividedPathLayoutStepFailed |  Layout algorithm failed.
DividedPathUpdateMergedPointKeysStepFailed |  Merging failed.
Top
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace